{"result": {"body": "<p>Steve Francia (commonly referred to as <a href=\"http://spf13.com\">spf13</a> works at\n<a href=\"http://www.10gen.com/\">10gen</a> on the popular NoSQL database\n<a href=\"http://en.wikipedia.org/wiki/Mongodb\">MongoDB</a>. That's impressive, but more\nimportantly to me he maintains spf13-vim which is appropriately self titled\n\"The Ultimate Vim Distribution.\"</p>\n<p>sfp13-vim is a collection of plugins and configurations to boost your\n<a href=\"http://www.vim.org\">Vim</a> experience. It is designed to work across different\noperating systems with minimal external dependencies. Installing it is trivial\nfor those running Linux or Macs and worth the effort if you're using Windows.\nInstalling the distribution is what helped me make the leap from \"modern\" IDEs\nto working solely in Vim.</p>\n<p>spf13 has done you a favor by reviewing different plugins and combining them\ntogether into this distribution. I have further tweaked the distribution to\nsuit my own preferences and workflow. spf13 made the configuration convenient\nto edit by writing your own .vimrc.local and .vimrc.bundles.local files. Use\nthe former for defining macros, functions, and keybindings and use the latter\nto enable/disable plugins or groups of plugins.</p>\n<p>If you would like to use my fork, and I so hope that you do, just visit\n<a href=\"https://github.com/jcbwlkr/spf13-vim\">jcbwlkr/spf13-vim</a> on\ngithub and follow the installation instructions. I will be adding additional\nresources and updating the documentation soon so stay tuned.</p>\n<h2>Update</h2>\n<p>Since this post was originally written I have stopped maintaining my spf13\nfork. spf13-vim is still a great distribution that I follow closely and I would\nrecommend it to anyone who wants to get a full featured vim configuration setup\nwithout doing all of the leg work. My own vim configuration is part of <a href=\"https://github.com/jcbwlkr/mydotfiles\">My\nDotfiles Repo</a>.</p>", "title": "spf13-vim: The Ultimate Vim Distribution", "tags": ["tool:vim"], "summary": "spf13 brings the IDE experience to Vim. I forked the project to add my own spin.", "date": "2013-02-02", "_id": "spf13-vim"}}