{"result": [{"description": "<p>Natural Organic Warehouse (NOW) is a distributor of organic products for\nfarming, gardening, and landscaping purposes. Their slogan is \"better, cleaner,\nsustainable choices.\" Through my consulting company <a href=\"http://tortuags-llc.com\">Tortugas Consulting,\nLLC</a> I helped to develop their online presence.\nThe site started with an open source e-commerce solution and has grown\nsignificantly to meet the unique needs of NOW. Notable features include\nintegration with shipping services and the <a href=\"http://www.avalara.com/\">Avalara AvaTax</a> API to\ncalculate and report accurate sales tax on local customers.</p>\n<p><a href=\"https://cart.naturalorganicwarehouse.com\">Natural Organic Warehouse</a></p>", "_id": "now", "order": 9, "name": "Natural Organic Warehouse"}, {"description": "<p>This site is obviously part of my portfolio. It is built with\n<a href=\"http://angularjs.org/\">Angular.js</a> and styled with Twitter Bootstrap and HTML5 Boilerplate.\nIt is hosted on GitHub Pages using my custom domain name.</p>\n<p>The resume portion of this site is an interesting piece of work. My resume is\nstored as a markdown file for ease of updating and versioning. I developed a\nnode.js script that uses a third party node module to convert the markdown file\nto HTML and then PDF. My code further acts on the generated HTML to make the\nweb view of the resume. The PDF is formatted through CSS.</p>\n<p><a href=\"https://github.com/jacobwalker0814/jacobwalker0814.github.io\">Site Source</a>\n<a href=\"https://github.com/jacobwalker0814/resume\">Resume Source</a></p>", "_id": "jacob-walker.com", "order": 1, "name": "jacob-walker.com"}, {"description": "<p>Since October 2010 the majority of my development focus has been with my\nemployer TimeIPS. We make a time and attendance system which is used by\nthousands of companies around the world. Tracking employee hours sounds simple\nwhen you think about it, but to stay competitive in the time and attendance\nmarket TimeIPS does so much more than tracking punches in and out.</p>\n<p>TimeIPS is used to\n<em> Track employee hours worked from a variety of hardware and software interfaces\n</em> Record benefit usages and accruals\n<em> Monitor employee adherence to schedules\n</em> Ensure employee coverage for particular tasks or locations\n<em> Calculate FLSA overtime\n</em> Record piecework pay such as tips and bonuses\n<em> Serve company documents to employees and managers\n</em> Calculate automatic holiday rules\n* And many other things</p>\n<p>At TimeIPS I am provided with the opportunity to work with the following technologies</p>\n<ul>\n<li>PHP</li>\n<li>Doctrine 2</li>\n<li>PHPUnit</li>\n<li>jQuery</li>\n<li>Android</li>\n<li>C++</li>\n<li>QT</li>\n<li>Python</li>\n<li>QEMU virtual machines</li>\n<li>Embedded Applications</li>\n</ul>\n<p><a href=\"http://timeips.com/videos/\">TimeIPS Videos</a></p>", "_id": "timeips", "order": 3, "name": "TimeIPS"}, {"subtitle": "Or How I Learned to Stop Worrying and Love the Regex", "description": "<p>In March 2013 I gave a presentation to my local web development group\n<a href=\"http://devict.org\">devICT</a> over the different forms and uses of Regular Expressions. The\ntalk was just under two hours long and was well received by the audience\n(approximately 25 developers). The presentation was broadcast through Google\nHangouts On Air and the video is available on <a href=\"http://youtu.be/4LnyHF8dnIk\">YouTube</a>.</p>\n<p><a href=\"https://github.com/jacobwalker0814/regex-101\">Slides and source</a></p>", "_id": "regex", "order": 5, "name": "Regular Expressions 101"}, {"description": "<p>When I started using Vim as my primary editor I found my second love. Its pure\nefficiency combined with its extendability have yet to leave me seriously\nwanting for any features. I maintain a fork of the popular <a href=\"http://wp.me/p32nVp-12\">spf13-vim</a>\ndistribution. I have also contributed a new theme to the <a href=\"https://github.com/bling/vim-airline\">vim-airline</a>\nproject.</p>\n<p><a href=\"https://github.com/jacobwalker0814/spf13-vim\">Source</a></p>", "_id": "vim", "order": 11, "name": "Vim Config"}, {"description": "<p>I have a friend who travels around the mid-west servicing natural gas\npipelines. As part of his duties he has to translate latitude / longitude\ncoordinates into state, township, range, and section information. He was doing\nthis by hand dozens of time per day. I found an API from the <a href=\"http://www.geocommunicator.gov/\">Departartment of\nthe Interior's Bureau of Land Management</a> which accepts coordinates and\nresponds with the exact information my friend needed. I created a client class\nthat can consume the API and another class that uses <a href=\"http://phpexcel.codeplex.com/\">PHPExcel</a> to\nparse an XLS spreadsheet with coordinates and populate it with the additional\ninformation.</p>\n<p><a href=\"https://github.com/jacobwalker0814/geocommunicator-client\">Source</a></p>", "_id": "geocommunicator", "order": 8, "name": "Geocommunicator API Client"}, {"subtitle": "Yet Another Game of Life :: In JavaScript", "description": "<p>When I first read about the <a href=\"http://www.catb.org/hacker-emblem/\">Universal Hacker Emblem</a> I got excited\nabout <a href=\"http://en.wikipedia.org/wiki/Conway_game\">Conway's Game of Life</a>. As an experiment I set out to see if I\ncould implement the game in only HTML5, Canvas, CSS and pure JavaScript. The\ngame works in both desktop and mobile browsers.</p>\n<p><a href=\"http://jacob-walker.com/yagl-js/\">Demo</a>\n<a href=\"https://github.com/jacobwalker0814/yagl-js\">Source</a></p>", "_id": "yagl", "order": 10, "name": "yagl-js"}, {"description": "<p>At home my desktop PC acts as a UPNP media server and is the box I use to\ndownload torrents. This machine is inconveniently located in my basement. There\nwere many times when I would want to start a download but the only device\nnearby is my phone. I found that finding and downloading a torrent file then\ngetting it to my torrent machine was a cumbersome process. Furthermore, many\nsites that index torrent files contain advertising that ranges from annoying to\ninappropriate to explicit. I decided to create a service that facilitates the\nprocess of finding the .torrent files and triggering their download. The\nservice does not download the torrent itself; just the torrent file.</p>\n<p>When I started this project I knew that I wanted to build the service as a REST\nAPI that I could then consume through various clients. I intend to develop web,\ncommand line, android, and iPhone applications. The service is written in\n<a href=\"http://bulletphp.com/\">Bullet PHP</a> and serves the API with the <a href=\"http://stateless.co/hal_specification.html\">HAL Hypermedia Type</a>.\nThe service was written using a combination of TDD and BDD practices with tests\nin PHPUnit and Frisby.js.</p>\n<p>This is a collaborative work with my co-worker and business partner <a href=\"http://matthewmkeeler.com\">Matthew M.\nKeeler</a>.</p>\n<p><a href=\"https://github.com/Tortugas-Consulting-LLC/find.torrent\">Source</a></p>", "_id": "find.torrent", "order": 4, "name": "find.torrent"}, {"description": "<p>Since my early teens I have been passionate about Role Playing Games with a\nspecial emphasis on Dungeons &amp; Dragons. Since February 2013 I have been\nrunning a quasi-monthly game in the Red Hand of Doom campaign. As a personal\nproject I decided to build a campaign journal site. The site is intended to\nchronicle the adventures of the players and provide a convenient place to\ndistribute information. It uses <a href=\"http://jekyllrb.com/\">Jekyll</a> and is hosted on GitHub Pages.</p>\n<p><a href=\"http://jacob-walker.com/campaign-journal\">Site</a>\n<a href=\"https://github.com/jacobwalker0814/campaign-journal\">Source</a></p>", "_id": "dnd", "order": 7, "name": "D&D Campaign Journal"}, {"description": "<p>It seems like every *nix developer hosts at least their bashrc file on GitHub\nand I am no exception. My repo uses the Ruby gem <a href=\"https://github.com/technicalpickles/homesick\">homesick</a> to easily\nkeep my config files in sync. To further ease the process I can install or\nupdate my config by running</p>\n<pre><code>bash &lt;( curl -L http://bit.ly/jacobwalker )\n</code></pre>\n\n<p><a href=\"https://github.com/jacobwalker0814/mydotfiles\">Source</a></p>", "_id": "dotfiles", "order": 6, "name": "My Dotfiles"}, {"description": "<p>devICT is a local development community that covers all aspects of development.\nI first joined the group in December of 2012 and have made it a priority to be\nactively involved. I help to organize events, find and engage new members, and\ngive presentations.</p>\n<p>The group's home on the web is <a href=\"http://devict.org\">devict.org</a> The site was previously\nhosted on Heroku but has since been moved to a VPS. The application runs on\nRails. I have made several contributions to the site such as setting up\ninfrastructure, the user management system, and the IRC users integration.</p>\n<p><a href=\"https://github.com/devict/devict.org\">Source</a></p>", "_id": "devict", "order": 2, "name": "devICT"}]}