{"result": [{"name": "cqlstore", "tags": ["language:go", "language:cassandra"], "summary": "A Go library for storing sessions in Cassandra", "_id": "cqlstore", "order": 17, "description": "<p>In Go web development the <a href=\"http://www.gorillatoolkit.org/\">Gorilla web toolkit</a> is a very popular\ncollection of libraries for common web tasks. The <code>gorilla/sessions</code> package\nprovides an easy interface for using/storing users' session data. The package\nitself relies on implementations of its storage interface so developers can\nstore the data in whatever place is best for their environment.</p>\n<p>For an application we were prototyping at work we elected to store everything\nin <a href=\"http://cassandra.apache.org/\">Cassandra DB</a>. There was no implementation for using\n<code>gorilla/sessions</code> with Cassandra so I created one.</p>\n<ul>\n<li><a href=\"https://github.com/jcbwlkr/cqlstore\">Source</a></li>\n<li><a href=\"https://godoc.org/github.com/jcbwlkr/cqlstore\">Documentation</a></li>\n</ul>"}, {"description": "<p>devICT is the primary development community in Wichita, KS boasting over 150\nmembers. The group covers all aspects of software development. Our mission is:</p>\n<blockquote>\n<p>To educate, empower, and connect software developers in the Wichita area.</p>\n</blockquote>\n<p>I first joined the group in December of 2012 and have since become one of the\norganizers. I help to organize and promote events, welcome new members, mediate\nconflicts, and give presentations.</p>\n<ul>\n<li><a href=\"http://devict.org\">devICT Site</a></li>\n<li><a href=\"http://meetup.com/devict\">Meetup Group</a></li>\n<li><a href=\"https://github.com/devict/\">GitHub Organization</a></li>\n</ul>", "subtitle": "Wichita's Development Community", "name": "devICT", "tags": ["concept:community"], "_id": "devict", "order": 10, "summary": "I am one of the organizers of Wichita's primary development community."}, {"name": "D&D Campaign Journal", "tags": ["language:ruby", "tool:jekyll", "tool:bootstrap"], "summary": "A Jekyll blog I keep to chronicle the D&D games I run.", "_id": "dnd", "order": 110, "description": "<p>Since my early teens I have been passionate about Role Playing Games with a\nspecial emphasis on Dungeons &amp; Dragons. Since February 2013 I have been\nrunning a quasi-monthly game in the Red Hand of Doom campaign. As a personal\nproject I decided to build a campaign journal site. The site is intended to\nchronicle the adventures of the players and provide a convenient place to\ndistribute information.</p>\n<p>It currently uses <a href=\"http://jekyllrb.com/\">Jekyll</a> and is hosted on GitHub Pages. I intend to\nrewrite it as an <a href=\"https://angularjs.org\">Angular</a> application consuming an API generated by\nmy project <a href=\"/portfolio/pysag.html\">pysag</a>.</p>\n<p><a href=\"http://jacob-walker.com/campaign-journal\">Site</a>\n<a href=\"https://github.com/jcbwlkr/campaign-journal\">Source</a></p>"}, {"name": "My Dotfiles", "tags": ["language:bash", "tool:vim"], "summary": "My linux command line configuration files. Designed to be shared across my machines.", "_id": "dotfiles", "order": 170, "description": "<p>It seems like every *nix developer hosts at least their bashrc file on GitHub\nand I am no exception. My repo uses the Ruby gem <a href=\"https://github.com/technicalpickles/homesick\">homesick</a> to easily\nkeep my config files in sync. To further ease the process I can install or\nupdate my config by running</p>\n<pre><code>bash &lt;( curl -L http://bit.ly/jacobwalker )\n</code></pre>\n\n<ul>\n<li><a href=\"https://github.com/jcbwlkr/mydotfiles\">My Dotfiles on GitHub</a></li>\n</ul>"}, {"name": "find.torrent", "tags": ["language:php", "concept:rest", "concept:api", "concept:tdd"], "summary": "An API server I wrote for discovering .torrent files.", "_id": "find.torrent", "order": 90, "description": "<p>At home my desktop PC acts as a UPNP media server and is the box I use to\ndownload torrents. This machine was inconveniently located in my basement. There\nwere many times when I would want to start a download but the only device\nnearby is my phone. I found that finding and downloading a torrent file then\ngetting it to my torrent machine was a cumbersome process. Furthermore, many\nsites that index torrent files contain advertising that ranges from annoying to\ninappropriate to explicit. I decided to create a service that facilitates the\nprocess of finding the <code>.torrent</code> files and triggering their download. The\nservice does not download the torrent itself; just the torrent file.</p>\n<p>When I started this project I knew that I wanted to build the service as a REST\nAPI that I could then consume through various clients. I intend to develop web,\ncommand line, Android, and iOS applications. The service was written in <a href=\"http://bulletphp.com/\">Bullet\nPHP</a> and serves the API with the <a href=\"http://stateless.co/hal_specification.html\">HAL Hypermedia Type</a>. The\nservice was developed using a combination of TDD and BDD practices with tests in\nPHPUnit and Frisby.js.</p>\n<p>This is a collaborative work with my co-worker and business partner <a href=\"http://matthewmkeeler.com\">Matthew M.\nKeeler</a>.</p>\n<p><a href=\"https://github.com/Tortugas-Consulting-LLC/find.torrent\">Source</a></p>"}, {"name": "Geocommunicator API Client", "tags": ["language:php", "concept:api"], "summary": "An API client I wrote for processing lat/long coordinates via one of the Bureau of Land Management's APIs", "_id": "geocommunicator", "order": 120, "description": "<p>I have a friend who travels around the country servicing natural gas pipelines.\nAs part of his duties he has to translate latitude / longitude coordinates into\nstate, township, range, and section information. He was doing this by hand\ndozens of time per day. I found an API from the <a href=\"http://www.geocommunicator.gov/\">Department of the Interior's\nBureau of Land Management</a> which accepts coordinates and responds with the\nexact information my friend needed. I created a client class that can consume\nthe API and another class that uses <a href=\"http://phpexcel.codeplex.com/\">PHPExcel</a> to parse an XLS\nspreadsheet with coordinates and populate it with the additional information.</p>\n<ul>\n<li><a href=\"https://github.com/jcbwlkr/geocommunicator-client\">Source</a></li>\n</ul>"}, {"name": "Getting Started With Go", "tags": ["language:go", "concept:community", "concept:presentation"], "summary": "A presentation I have given about the Go programming language.", "_id": "getting-started-with-go", "order": 15, "description": "<p>This is a talk I presented at the first <a href=\"http://lanyrd.com/2015/klf15/\">Kansas Linux Fest</a> in March 2015.\nI gave it again that month at my company's internal roundtable and will present\nit again for <a href=\"/portfolio/devict.html\">devICT</a> on July 23rd.</p>\n<p>The talk introduces <a href=\"http://golang.org/\">the Go programming language</a> by highlighting some\nimportant features and provides advice on how to be successful in adopting the\nlanguage.</p>\n<p>Video to come soon.</p>\n<ul>\n<li><a href=\"https://github.com/jcbwlkr/gettingstartedwithgo/raw/master/slides.pdf\">Slides</a></li>\n<li><a href=\"https://github.com/jcbwlkr/gettingstartedwithgo\">Source</a></li>\n</ul>"}, {"name": "httpmatchers", "tags": ["language:go"], "summary": "A Go library extending the Gomega TDD library for testing HTTP responses.", "_id": "httpmatchers", "order": 18, "description": "<p>BDD in Go is made easier using the <a href=\"http://onsi.github.io/ginkgo/\">Ginkgo</a> and <a href=\"http://onsi.github.io/gomega/\">Gomega</a>\npackages. Gomega specifically provides a collection of matchers for asserting\nthat results match expectations. When using these tools to test an API I was\ndeveloping I noticed some common patterns appearing around the assertion of\nHTTP status codes. I created the <code>github.com/jcbwlkr/httpmatchers</code> package to\nsimplify some of those patterns.</p>\n<ul>\n<li><a href=\"https://github.com/jcbwlkr/httpmatchers\">Source</a></li>\n<li><a href=\"https://godoc.org/github.com/jcbwlkr/httpmatchers\">Documentation</a></li>\n</ul>"}, {"name": "Implementing OOP", "tags": ["language:php", "language:ruby", "concept:community", "concept:presentation", "concept:oop"], "summary": "A presentation I gave to devICT covering the basics of OOP in PHP and Ruby.", "_id": "implementing-oop", "order": 60, "description": "<p>Back in June 2014 I gave a presentation to <a href=\"/portfolio/devict.html\">devICT</a> about how to use\nObject Oriented Programming in PHP and Ruby. I chose this topic when I was\nexplaining inheritance to a friend and realized others would be interested. I\nchose PHP and Ruby for examples because I was already familiar with OOP in PHP\nand I wanted to learn more about Ruby's object model.</p>\n<p>The talk is an hour and a half long. It covers the basic ideas and syntax of\nOOP such as:</p>\n<ul>\n<li>Class vs Object</li>\n<li>Properties and Methods</li>\n<li>Access modifiers (public, private, protected)</li>\n<li>Inheritance</li>\n<li>Static or Class methods and properties</li>\n<li>Method overriding</li>\n<li>Abstract classes</li>\n<li>Interfaces</li>\n</ul>\n<p>More info:</p>\n<ul>\n<li><a href=\"http://youtu.be/7QoEfPYULXM\">Video</a></li>\n<li><a href=\"/implementing-oop/presentation/\">Slides</a></li>\n<li><a href=\"https://github.com/jcbwlkr/implementing-oop\">Source</a></li>\n</ul>\n<div class=\"embed-responsive embed-responsive-4by3\">\n  <iframe class=\"embed-responsive-item\" src=\"//www.youtube.com/embed/7QoEfPYULXM\" allowfullscreen></iframe>\n</div>"}, {"name": "jacob-walker.com", "tags": ["language:python", "language:node", "tool:bootstrap"], "summary": "This site!", "_id": "jacob-walker.com", "order": 40, "description": "<p>My portfolio is part of my portfolio... how meta!</p>\n<p>The site is generated using my site generator <a href=\"/portfolio/pysag.html\">pysag</a>. It is styled with\nTwitter Bootstrap and HTML5 Boilerplate. It is hosted on GitHub Pages using my\ncustom domain name.</p>\n<p>The resume portion of this site is an interesting piece of work. My resume is\nstored as a markdown file for ease of updating and versioning. I developed a\nnode.js script that uses a third party node module to convert the markdown file\nto HTML and then PDF. My code further acts on the generated HTML to make the\nweb view of the resume. The PDF is formatted through CSS.</p>\n<ul>\n<li><a href=\"https://github.com/jcbwlkr/jcbwlkr.github.io\">Site Source</a></li>\n<li><a href=\"https://github.com/jcbwlkr/resume\">Resume Source</a></li>\n</ul>"}, {"name": "LiveJournal Amnesia", "tags": ["language:ruby", "concept:api"], "summary": "A quick script to mark all of my old high school LiveJournal posts as private.", "_id": "livejournal-amnesia", "order": 100, "description": "<p><a href=\"https://github.com/jcbwlkr/livejournal-amnesia\">LiveJournal Amnesia</a> is a quick script I wrote to automate the\nprocess of hiding the 200-some LiveJournal blog posts I generated in my late\nteens. It uses a public gem to talk to the LiveJournal API. Check out <a href=\"https://github.com/jcbwlkr/livejournal-amnesia\">the\nREADME on GitHub</a> for more info then you, too, can pretend like\nyou never wrote that poem Junior year!</p>"}, {"name": "Norris Training Systems", "tags": ["language:php", "tool:symfony", "tool:bootstrap", "concept:e-commerce"], "summary": "A SF2 app/e-commerce site for insurance agents to purchase and schedule training services.", "_id": "norris-training", "order": 140, "description": "<p><a href=\"http://norristraining.com\">Norris Training Systems</a> provides pre-licensing and continuing\neducation training to insurance agents. My consulting company <a href=\"http://tortugas-llc.com\">Tortugas\nConsulting, LLC</a> developed their e-commerce website which allows\nagents to purchase and schedule classes. Additionally agents can download\ndocuments associated with their course and take related quizzes to prepare for\ntheir state license exam.</p>\n<p>The site was built on the <a href=\"http://symfony.com\">Symfony 2</a> framework. Another agency was\ncontracted to mock up the design which we implemented.</p>\n<ul>\n<li><a href=\"http://norristraining.com\">Norris Site</a></li>\n</ul>"}, {"name": "Natural Organic Warehouse", "tags": ["language:php", "concept:e-commerce"], "summary": "An e-commerce site for a natural farming/gardening company.", "_id": "now", "order": 130, "description": "<p>Natural Organic Warehouse (NOW) is a distributor of organic products for\nfarming, gardening, and landscaping purposes. Their slogan is \"better, cleaner,\nsustainable choices.\" Through my consulting company <a href=\"http://tortugas-llc.com\">Tortugas Consulting,\nLLC</a> I helped to develop their online presence.\nThe site started with an open source e-commerce solution and has grown\nsignificantly to meet the unique needs of NOW. Notable features include\nintegration with shipping services and the <a href=\"http://www.avalara.com/\">Avalara AvaTax</a> API to\ncalculate and report accurate sales tax on local customers.</p>\n<ul>\n<li><a href=\"https://cart.naturalorganicwarehouse.com\">NOW Site</a></li>\n</ul>"}, {"description": "<p><a href=\"pysag\">pysag</a> is a tool I am developing for generating static web apps. It\ndiffers from other (great) static site generators like Jekyll by being focused\non data first and pages second.</p>\n<p>The user defines their data such as blog posts, employees, or products in the\nfilesystem as yaml files. This data is first converted to json files to\ngenerate a read-only \"API\". The ideal usecase here is a JavaScript application\nto render the data. Properties of the yaml files can be paths to\n<a href=\"markdown\">Markdown</a> files for easy authoring. If desired the data can be fed\nto <a href=\"jinja2\">Jinja2</a> templates to create true static pages.</p>\n<p>Check out the README on <a href=\"pysag\">GitHub</a> for a better description.</p>", "subtitle": "The Python Static site and API Generator", "name": "pysag", "tags": ["language:python", "tool:jinja2"], "_id": "pysag", "order": 30, "summary": "My own static site generator with a different take on generation."}, {"description": "<p>In March 2013 I gave a presentation to my local web development group\n<a href=\"/portfolio/devict.html\">devICT</a> over the different forms and uses of Regular Expressions. The\ntalk was just under two hours long and was well received by the audience\n(approximately 25 developers). The presentation was broadcast through Google\nHangouts On Air and the video is available on <a href=\"http://youtu.be/4LnyHF8dnIk\">YouTube</a>.</p>\n<p><a href=\"https://github.com/jcbwlkr/regex-101\">Slides and source</a></p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n  <iframe class=\"embed-responsive-item\" src=\"//www.youtube.com/embed/4LnyHF8dnIk\" allowfullscreen></iframe>\n</div>", "subtitle": "Or How I Learned to Stop Worrying and Love the Regex", "name": "Regular Expressions 101", "tags": ["tool:regex", "concept:community", "concept:presentation"], "_id": "regex-101", "order": 50, "summary": "A presentation I gave to devICT teaching basic and advanced features of regex."}, {"description": "<p><a href=\"http://startupwichita.com\">Startup Wichita</a> is a grass roots effort to connect entrepreneurs in\nWichita with local people and resources. In March 2014 <a href=\"/portfolio/devict.html\">devICT</a> held a\nhackathon to kick-start development on a community site. We decided to build\nthe site on the <a href=\"mean\">MEAN stack</a> (MongoDB, Express, Angular, and Node). We\nprovisioned a development environment with <a href=\"http://puppetlabs.com\">Puppet</a> and\n<a href=\"http://vagrantup.com\">Vagrant</a>. We split into teams for content, design, front end\ndevelopment and back end development. I managed the various teams, helped\ndevelopers set up their environments, and merged pull requests.</p>\n<p>The hackathon laid the ground work for the application but at the end of the\nday there was still a lot of work to be done. Over the next several months\ndevICT members met periodically to push the site forward. Progress was slow as\neach developer was only working in their spare time.</p>\n<p>In September (6 months since the hackathon) the Entrepreneurship Task Force of\nthe Wichita Metro Chamber of Commerce hired my company <a href=\"http://tortugas-llc.com\">Tortugas Consulting,\nLLC</a> to dedicate development resources towards the completion of the\nsite. The first phase milestone was reached on October 21st 2014 with two\nadditional milestones planned over the next few months.</p>\n<ul>\n<li><a href=\"http://startupwichita.com\">Startup Wichita site</a></li>\n<li><a href=\"https://github.com/jcbwlkr/regex-101\">Startup Wichita on GitHub</a></li>\n</ul>", "subtitle": "startupwichita.com", "name": "Startup Wichita", "tags": ["language:node", "language:mongo", "tool:angular", "tool:bootstrap", "concept:community", "concept:tdd"], "_id": "startup-wichita", "order": 80, "summary": "A community resource website for entrepreneurs written on the MEAN.io stack."}, {"name": "TimeIPS", "tags": ["language:php", "language:python", "language:javascript", "language:bash", "language:c++", "tool:doctrine", "tool:silex", "tool:angular", "tool:less", "tool:jenkins", "concept:tdd", "concept:rest"], "summary": "My day job for about 4.5 years: a complicated time and attendance application.", "_id": "timeips", "order": 20, "description": "<p>From October 2010 to February 2015 the majority of my development focus has\nbeen with my employer TimeIPS. We made a time and attendance system which is\nused by thousands of companies around the world.</p>\n<p>TimeIPS is used to</p>\n<ul>\n<li>Track employee hours worked from a variety of hardware and software interfaces</li>\n<li>Record benefit usages and accruals</li>\n<li>Monitor employee adherence to schedules</li>\n<li>Ensure employee coverage for particular tasks or locations</li>\n<li>Calculate FLSA overtime</li>\n<li>Record piecework pay such as tips and bonuses</li>\n<li>Serve company documents to employees and managers</li>\n<li>Calculate automatic holiday rules</li>\n<li>And many other things</li>\n</ul>\n<p>At TimeIPS I lead a team of 4 in the development of our products. Some of my\nmajor accomplishments in this role include:</p>\n<ul>\n<li>Introducing Test Driven Development with <a href=\"https://phpunit.de/\">PHPUnit</a></li>\n<li>Implementing Continuous Integration with <a href=\"http://jenkins-ci.org/\">Jenkins-CI</a></li>\n<li>Starting code reviews via <a href=\"http://phabricator.org/\">Phabricator</a></li>\n<li>Leading the development of a REST API</li>\n<li>Working to update legacy code to use the <a href=\"http://www.doctrine-project.org/\">Doctrine 2</a> ORM</li>\n<li>Implementing a Zero Defect policy</li>\n<li>Developing a system for managing our farm of QEMU virtual machines</li>\n<li>Revamped our build process making heavy use of <a href=\"https://getcomposer.org/\">Composer</a>,\n  <a href=\"http://gulpjs.com/\">Gulp</a>, and <a href=\"http://bower.io/\">Bower</a></li>\n</ul>"}, {"name": "Templating In PHP With Twig", "tags": ["concept:community", "concept:presentation", "language:php", "tool:twig"], "summary": "A presentation I gave to devICT introducing the basics of the Twig templating language", "_id": "twig", "order": 70, "description": "<p>In November 2013 I gave a short presentation to <a href=\"/portfolio/devict.html\">devICT</a> about the PHP\ntemplating enging <a href=\"http://twig.sensiolabs.org\">Twig</a>. The talk covered the basics of\ninstalling/configuring Twig, rendering templates, and writing templates.</p>\n<p>The talk is 23 minutes long.</p>\n<p>More info:</p>\n<ul>\n<li><a href=\"http://youtu.be/deqGYV8P0Nc\">Video</a></li>\n<li><a href=\"/twig-talk/presentation/\">Slides</a></li>\n<li><a href=\"https://github.com/jcbwlkr/twig-talk\">Source</a></li>\n</ul>\n<div class=\"embed-responsive embed-responsive-4by3\">\n  <iframe class=\"embed-responsive-item\" src=\"//www.youtube.com/embed/deqGYV8P0Nc\" allowfullscreen></iframe>\n</div>"}, {"name": "Vim Config", "tags": ["tool:vim"], "summary": "My contributions to the Vim ecosystem.", "_id": "vim", "order": 180, "description": "<p>When I started using Vim as my primary editor I found my second love. Its pure\nefficiency combined with its extendability have yet to leave me seriously\nwanting for any features. I previously maintained a fork of the popular <a href=\"/blog/spf13-vim.html\">spf13-vim</a> distribution. I have since abandoned that fork and created my own <code>.vimrc</code> which is hosted with <a href=\"/portfolio/dotfiles.html\">my dotfiles</a>.</p>\n<p>I have also ported the default <a href=\"https://github.com/lokaltog/powerline\">Powerline</a> theme to the\n<code>powerlineish</code> theme in the <a href=\"https://github.com/bling/vim-airline\">vim-airline</a> project.</p>"}, {"name": "Wrecking Ball Media", "tags": ["language:go", "language:bash", "tool:aws", "tool:docker", "tool:jenkins", "tool:ansible", "concept:tdd", "concept:rest"], "summary": "My current primary job where I work on a project for Adobe.", "_id": "wrecking-ball-media", "order": 12, "description": "<p>Since February 2015 I have been a contracting engineer at <a href=\"http://wreckingballmedia.com/\">Wrecking Ball Media\nGroup</a>. As a part of this team I am working on a web based platform for\n<a href=\"http://www.adobe.com/\">Adobe</a>. The project utilizes several different APIs from Adobe and\nother vendors. More project details to come after the project launches.</p>\n<p>For this project I primarily am working in Go. I have developed the server\napplication composing middleware, Go templating, a REST API, request contexts,\na service layer, logger, internationalization, and unit and integration tests.</p>\n<p>Additionally I have constructed the team's Continuous Integration and\nContinuous Deployment pipelines using Ansible, Docker, Jenkins, Hipchat, and\nAWS.</p>"}, {"description": "<p>When I first read about the <a href=\"http://www.catb.org/hacker-emblem/\">Universal Hacker Emblem</a> I got excited\nabout <a href=\"http://en.wikipedia.org/wiki/Conway_game\">Conway's Game of Life</a>. As an experiment I set out to see if I\ncould implement the game in only HTML5, Canvas, CSS and pure JavaScript. The\ngame works in both desktop and mobile browsers.</p>\n<ul>\n<li><a href=\"http://jacob-walker.com/yagl-js/\">Demo</a></li>\n<li><a href=\"https://github.com/jcbwlkr/yagl-js\">Source</a></li>\n</ul>", "subtitle": "Yet Another Game of Life :: In JavaScript.", "name": "yagl-js", "tags": ["language:javascript", "language:html5", "tool:canvas"], "_id": "yagl", "order": 160, "summary": "Yet Another Game of Life :: In JavaScript."}, {"name": "Young Life Wichita", "tags": ["language:ruby", "tool:rails", "tool:bootstrap"], "summary": "A Rails application for tracking event RSVPs.", "_id": "young-life-wichita", "order": 150, "description": "<p><a href=\"http://myylwichita.com\">Young Life Wichita</a> (YLW) is a local chapter of the larger Young Life\norganization. YLW supports local families through various charitable events and\nactivities. My consulting company was hired to develop an online application\nwhere people could RSVP for different activities.</p>\n<p>The website was built on Rails 4 with Twitter Bootstrap. Another local agency\nBarrett Morgan LLC developed the look which we implemented.</p>\n<ul>\n<li><a href=\"http://myylwichita.com\">Young Life Wichita Site</a></li>\n</ul>"}]}